## Staging: network
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 8 to add, 0 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                          NAME                          |
|--------|--------------------------------------------------------|
| add    | `aws_security_group.glue_job`                          |
|        | `aws_security_group_rule.forms_db_ingress_glue_job`    |
|        | `aws_security_group_rule.glue_job_egress_forms_db`     |
|        | `aws_security_group_rule.glue_job_egress_internet`     |
|        | `aws_security_group_rule.glue_job_egress_privatelink`  |
|        | `aws_security_group_rule.glue_job_ingress_self`        |
|        | `aws_security_group_rule.privatelink_glue_job_ingress` |
|        | `aws_vpc_endpoint.glue`                                |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_security_group.glue_job will be created
  + resource "aws_security_group" "glue_job" {
      + arn                    = (known after apply)
      + description            = "AWS Glue jobs"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "glue_job"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags_all               = {
          + "CostCentre" = "forms-platform-staging"
          + "Terraform"  = "true"
        }
      + vpc_id                 = "vpc-0ad5b3739860129d0"
    }

  # aws_security_group_rule.forms_db_ingress_glue_job will be created
  + resource "aws_security_group_rule" "forms_db_ingress_glue_job" {
      + description              = "Ingress to Forms database from Glue jobs"
      + from_port                = 5432
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = "sg-0b80bb714d886b8ff"
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 5432
      + type                     = "ingress"
    }

  # aws_security_group_rule.glue_job_egress_forms_db will be created
  + resource "aws_security_group_rule" "glue_job_egress_forms_db" {
      + description              = "Egress from Glue jobs to Forms database"
      + from_port                = 5432
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = "sg-0b80bb714d886b8ff"
      + to_port                  = 5432
      + type                     = "egress"
    }

  # aws_security_group_rule.glue_job_egress_internet will be created
  + resource "aws_security_group_rule" "glue_job_egress_internet" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "Egress from Glue jobs to internet (HTTPS)"
      + from_port                = 443
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 443
      + type                     = "egress"
    }

  # aws_security_group_rule.glue_job_egress_privatelink will be created
  + resource "aws_security_group_rule" "glue_job_egress_privatelink" {
      + description              = "Egress from AWS Glue jobs to PrivateLink endpoints"
      + from_port                = 443
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = "sg-089a83b7d81dff031"
      + to_port                  = 443
      + type                     = "egress"
    }

  # aws_security_group_rule.glue_job_ingress_self will be created
  + resource "aws_security_group_rule" "glue_job_ingress_self" {
      + description              = "Ingress to Glue jobs from self on all ports.  This is a requirement for VPC connected Glue jobs."
      + from_port                = 0
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = true
      + source_security_group_id = (known after apply)
      + to_port                  = 65535
      + type                     = "ingress"
    }

  # aws_security_group_rule.privatelink_glue_job_ingress will be created
  + resource "aws_security_group_rule" "privatelink_glue_job_ingress" {
      + description              = "Security group rule for Glue job ingress"
      + from_port                = 443
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = "sg-089a83b7d81dff031"
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 443
      + type                     = "ingress"
    }

  # aws_vpc_endpoint.glue will be created
  + resource "aws_vpc_endpoint" "glue" {
      + arn                   = (known after apply)
      + cidr_blocks           = (known after apply)
      + dns_entry             = (known after apply)
      + id                    = (known after apply)
      + ip_address_type       = (known after apply)
      + network_interface_ids = (known after apply)
      + owner_id              = (known after apply)
      + policy                = (known after apply)
      + prefix_list_id        = (known after apply)
      + private_dns_enabled   = true
      + requester_managed     = (known after apply)
      + route_table_ids       = (known after apply)
      + security_group_ids    = [
          + "sg-089a83b7d81dff031",
        ]
      + service_name          = "com.amazonaws.ca-central-1.glue"
      + service_region        = (known after apply)
      + state                 = (known after apply)
      + subnet_ids            = [
          + "subnet-07e38df0760d389d1",
          + "subnet-07f9debd31e48ce64",
          + "subnet-0af8e6e3cf80f582d",
        ]
      + tags_all              = {
          + "CostCentre" = "forms-platform-staging"
          + "Terraform"  = "true"
        }
      + vpc_endpoint_type     = "Interface"
      + vpc_id                = "vpc-0ad5b3739860129d0"

      + dns_options (known after apply)

      + subnet_configuration (known after apply)
    }

Plan: 8 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + glue_job_security_group_id    = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_default_network_acl.forms"]
WARN - plan.json - main - Missing Common Tags: ["aws_default_security_group.default"]
WARN - plan.json - main - Missing Common Tags: ["aws_eip.forms_natgw[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_eip.forms_natgw[1]"]
WARN - plan.json - main - Missing Common Tags: ["aws_eip.forms_natgw[2]"]
WARN - plan.json - main - Missing Common Tags: ["aws_flow_log.vpc_flow_logs[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_internet_gateway.forms"]
WARN - plan.json - main - Missing Common Tags: ["aws_nat_gateway.forms[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_nat_gateway.forms[1]"]
WARN - plan.json - main - Missing Common Tags: ["aws_nat_gateway.forms[2]"]
WARN - plan.json - main - Missing Common Tags: ["aws_route_table.forms_private_subnet[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_route_table.forms_private_subnet[1]"]
WARN - plan.json - main - Missing Common Tags: ["aws_route_table.forms_private_subnet[2]"]
WARN - plan.json - main - Missing Common Tags: ["aws_route_table.forms_public_subnet"]
WARN - plan.json - main - Missing Common Tags: ["aws_security_group.api_ecs"]
WARN - plan.json - main - Missing Common Tags: ["aws_security_group.connector_db"]
WARN - plan.json - main - Missing Common Tags: ["aws_security_group.forms"]
WARN - plan.json - main - Missing Common Tags: ["aws_security_group.forms_database"]
WARN - plan.json - main - Missing Common Tags: ["aws_security_group.forms_egress"]
WARN - plan.json - main - Missing Common Tags: ["aws_security_group.forms_load_balancer"]
WARN - plan.json - main - Missing Common Tags: ["aws_security_group.forms_redis"]
WARN - plan.json - main - Missing Common Tags: ["aws_security_group.glue_job"]
WARN - plan.json - main - Missing Common Tags: ["aws_security_group.idp_db"]
WARN - plan.json - main - Missing Common Tags: ["aws_security_group.idp_ecs"]
WARN - plan.json - main - Missing Common Tags:...
```

</details>
